import { Prisma } from '@prisma/client';

export const categoriesData: Prisma.CategoryCreateInput[] = [
  {
    name: 'Екшн',
    description: 'Динамічні та захоплюючі сцени з енергією та адреналіном.',
  },
  {
    name: 'Повітряна зйомка',
    description: 'Зображення, що передають легкість та велич простору з неба.',
  },
  {
    name: 'Природа',
    description:
      'Краса природи, ландшафтів, рослин і тварин у їх природному середовищі.',
  },
  {
    name: 'Тварини',
    description: 'Різні види тварин у їх природному середовищі',
  },
  {
    name: 'Мистецтво',
    description: 'Твори, які виражаються через різноманітні форми.',
  },
  {
    name: 'Архітектура',
    description: 'Будівлі та інші інженерні витвори.',
  },
  {
    name: 'Чорно-біле',
    description:
      'Чорно-білі зображення, які передають емоції через контраст та текстуру.',
  },
  {
    name: 'Автомобілі',
    description: 'Автомобілі, що демонструють дизайн та рух.',
  },
  {
    name: 'Колір',
    description:
      'Яскраві кольори та контрасти, що привертають увагу та створюють позитивний настрій.',
  },
  {
    name: 'Мода',
    description: 'Стильні образи, модні тренди, одяг та аксесуари.',
  },
  {
    name: 'Їжа',
    description:
      'Смачні та апетитні страви, які викликають бажання скуштувати.',
  },
  {
    name: 'Історія',
    description:
      'Фотографії, що передають важливі моменти з минулого та історичні події.',
  },
  {
    name: 'Свято',
    description:
      'Моменти радості та святкових подій, які дарують позитивні емоції.',
  },
  {
    name: 'Інтер’єр',
    description: 'Дизайн приміщень та їх деталей.',
  },
  {
    name: 'Макро',
    description:
      'Детальні знімки маленьких об’єктів, які часто залишаються непоміченими.',
  },
  {
    name: 'Ретро',
    description:
      'Старовинні зображення, що викликають ностальгію за минулими епохами.',
  },
  {
    name: 'Небо',
    description:
      'Небо в різні пори доби та року, від заходів до сонячних днів.',
  },
  {
    name: 'Спорт',
    description: 'Захоплюючі моменти спорту, які передають енергію та рух.',
  },
  {
    name: 'Натюрморт',
    description:
      'Майстерно зняті композиції неживих предметів, що створюють естетичний вигляд.',
  },
  {
    name: 'Вулиця',
    description: 'Повсякденне життя та події на вулицях міста.',
  },
  {
    name: 'Подорожі',
    description:
      'Моменти подорожей, що захоплюють красу нових місць і культур.',
  },
  {
    name: 'Вода',
    description: 'Вода в різних її формах: річки, озера, море та дощ.',
  },
];
