import { Prisma } from '@prisma/client';

export const commentsData: Omit<
  Prisma.CommentUncheckedCreateInput,
  'postId' | 'userId'
>[] = [
  {
    comment:
      'Це фото змінило моє сприйняття цієї теми. Вражаючий підхід до композиції, який дозволяє побачити знайомі речі по-новому. Браво!',
  },
  {
    comment:
      'Чудово підготовлене фото, яке передає всю атмосферу моменту. Ви змогли вдало поєднати кольори і світло, це справжнє мистецтво!',
  },
  {
    comment:
      'Чудова робота! Ваш підхід до зйомки та постобробки створює надзвичайну атмосферу, яка зачаровує з першого погляду.',
  },
  {
    comment:
      'Цей знімок показує, як можна поєднувати емоції та кольори таким чином, щоб створити унікальний ефект. Просто фантастика!',
  },
  {
    comment:
      'Чи є можливість дізнатися, як вам вдалося досягти такого ефекту на фото? Це просто неймовірно, такий рівень майстерності!',
  },
  {
    comment:
      'Можливо, ви могли б поділитися, що вас надихнуло на цей знімок? Я б хотів зрозуміти глибше вашу ідею за цією фотографією.',
  },
  {
    comment:
      'Просто чудово! Ця фотографія дійсно вражає і має величезний емоційний вплив на того, хто її бачить. Чудова робота!',
  },
  {
    comment:
      'Вражаюча композиція! Ваша здатність передавати атмосферу через фото вражає. Я відчуваю себе в самому серці цього моменту!',
  },
  {
    comment:
      'Це фото дійсно змусило мене задуматися. Вражаюче поєднання світла та тіні, яке привертає увагу і змушує дивитися знову і знову.',
  },
  {
    comment:
      'Чудова публікація! Це фото має таку потужну емоційну напругу, що я не можу відірватися від нього. Ваша робота справжнє мистецтво!',
  },
  {
    comment:
      'Цей кадр виглядає просто чудово! Яка історія стоїть за цією фотографією? Чи є якісь цікаві деталі, які ви хочете поділитися?',
  },
  {
    comment:
      'Чудовий знімок! Мені дуже подобається, як ви працюєте зі світлом і тінями. Ваша здатність балансувати ці елементи вражає.',
  },
  {
    comment:
      'Вражає! Це фото передає таку глибину і емоцію, що я відчуваю себе частиною цього моменту. Ваша робота надзвичайна!',
  },
  {
    comment:
      'Це фото справжній шедевр! Як вам вдалося передати таку атмосферу та емоцію через об`єктив? Це дійсно вражає!',
  },
  {
    comment:
      'Чудова робота! Ви змогли вдало захопити момент, який важко передати словами. Це фото справжня магія.',
  },
  {
    comment:
      'Мені дуже подобається, як ви граєте з кольорами і світлом. Це створює неймовірний ефект, який зачаровує.',
  },
  {
    comment:
      'Просто неймовірно! Ваша фотографія дійсно розповідає свою історію, і кожен кадр створює нову емоцію.',
  },
  {
    comment:
      'Неймовірний кадр! Це фото справжнє мистецтво, кожен елемент чудово підібраний для того, щоб створити глибокий емоційний ефект.',
  },
  {
    comment:
      'Ваша робота завжди вражає! Це фото є чудовим прикладом вашого таланту і майстерності. Я з нетерпінням чекаю на нові публікації!',
  },
  {
    comment:
      'Це фото дійсно вражає своєю простотою та глибиною. Ви змогли передати стільки емоцій у одному кадрі. Чудово!',
  },
  {
    comment:
      'Чудова робота! Це фото справді змушує задуматися над його значенням. Ви показали, як важливо бачити красу в простих речах.',
  },
  {
    comment:
      'Дякую за таку чудову публікацію! Це зображення надихає на створення власних творів і дарує новий погляд на звичні речі.',
  },
  {
    comment:
      'Це фото змусило мене захоплюватися кожним його елементом. Ви чудово передаєте емоції через композицію та кольори.',
  },
  {
    comment:
      'Вражаюча робота! Як ви досягли такого унікального ефекту на фотографії? Це виглядає дуже професійно і інноваційно!',
  },
  {
    comment:
      'Це просто чудово! Ця фотографія має величезний емоційний заряд і передає відчуття, які важко описати словами.',
  },
  {
    comment:
      'Неймовірно! Ваша фотографія дійсно передає атмосферу цього моменту. Ви зробили неймовірну роботу!',
  },
  {
    comment:
      'Чудова композиція! Ви чудово зловили саме ту мить, яку варто було зафіксувати. Це фото дійсно відображає емоції!',
  },
  {
    comment:
      'Це фото є справжнім шедевром! Техніка фотографії на висоті, і ви чудово передаєте атмосферу через кожен кадр.',
  },
  {
    comment:
      'Справжній витвір мистецтва! Ваша здатність захопити момент і створити таку глибину в кадрі вражає.',
  },
  {
    comment:
      'Ваша фотографія точно залишає враження. Дуже цікаво було побачити цей знімок і подивитися на вашу роботу!',
  },
  {
    comment:
      'Це фото дійсно вражає! Ваша техніка роботи зі світлом і композицією створює унікальний ефект, який неможливо забути.',
  },
  {
    comment:
      'Цей знімок передає неймовірну емоцію, що змушує задуматися. Ви вражаєте своєю здатністю бачити світ під іншим кутом.',
  },
  {
    comment:
      'Це фото стало для мене джерелом натхнення. Ваша робота справді заслуговує на увагу і захоплення!',
  },
  {
    comment:
      'Це фото – справжнє мистецтво! Ваша техніка й погляд на світ дуже вражають і змушують дивитися на фотографії інакше.',
  },
];
